import Footer from "@/components/UI/footer";
import Header from "@/components/UI/header";
import Banner from "@/components/UI/banner";
import ProductLists from "@/components/store/productsList";
import { useAppDispatch, useAppSelector } from "@/store/HOCs";
import { NextSeo } from "next-seo";
import { Collapse } from "antd";
import Image from "next/image";
import Input from "@/components/UI/input";
import PhoneInput from "@/components/UI/phoneInput";
import { useState } from "react";
import { setNotif } from "@/store/core/slice";

const questions = {
  "چرا خط هشت ؟؟ وجه تمایز انتشارات خط هشت":
    "ارائه کتاب شما در نمایشگاه های بین المللی کتاب بویژه نمایشگاه کتاب تهران - معرفی و فروش اینترنتی کتاب های چاپ شده - ارائه خدمات آنلاین و غیر حضوری - مشاوره رایگان و واقع‌گرایانه -  چاپ کتاب در تیراژ پایین - راهنمای انتخاب روش چاپ مناسب کتاب - معرفی نویسندگان - برگزاری نشستهای تخصصی نقد وبررسی کتاب -  تبدیل پایان نامه به کتاب -  هزینه مناسب و پایین چاپ کتاب -  برگزاری نمایشگاه های کتاب در سطح استان و شهرستانها - انجام تبلیغات محیطی و معرفی کتابهای چاپ شده  - برگزاری مسابقات کتاب و کتابخوانی - برگزاری نمایشگاه کتاب در سطح مدارس و دانشگاه‌ها. انتشارات خط هشت با رویکرد حفظ و زنده نگه داشتن کتاب و همچنین توسعه فرهنگ کتابخوانی اقدام به راه اندازی چاپ کتاب به اندازه ی تقاضا در راستای حفظ منابع سبزمان و کاهش بی رویه کاغذ و همچنین چاپ در کوتاهترین زمان ممکن در استان اردبیل نموده است. آیا به دنبال برآورد قیمت چاپ کتاب هستید؟ آیا نگران کیفیت و زمان تحویل چاپ کتاب خود هستید؟ آیا به دنبال چاپ با کیفیت کتاب خود هستید؟زمان کافی برای سیر مراحل چاپ کتاب را ندارید؟ چاپ کتاب خود را به ما بسپارید. - چاپ ارزان کتاب از صفر تا صد - تبدیل پایان نامه به کتاب- تمام راه کارهای خوب چاپ کتاب را برای شما در یک جا جمع کرده ایم. نهایت کیفیت و سرعت در انجام خدمات با پایین ترین و ارزان ترین قیمت سرلوحه و شعار مجموعه خط هشت در حوزه چاپ و نشر می باشد. کتاب های خود را به سرعت در تیراژ کم چاپ کنید. در تیراژ پایین چاپ کنید و هزینه های خود را کاهش دهید. ایده ها و برند خود را کتاب کنید. برای شروع یک کار موفق بهتر است یکباره هزینه نکنید ، تیراژ کم با چاپ دیجیتال با کیفیت",
  "شابک چیست ؟":
    "شابک :  شمارهٔ استاندارد بین‌المللی کتاب یا شابک شماره‌ای متشکل از ۱۰ یا ۱۳ رقم است که به کتاب‌های منتشرشده منسوب می‌شود و هر شماره منحصر به یک کتاب (یا یک نگارش یا نوع مشخص از آن کتاب) است، اما تجدید چاپ کتاب باعث تغییر شابک نمی‌شود. شابک را در زبان‌هایی که از خط لاتین استفاده می‌کنند با سرواژهٔ« ISBN » مخفف عبارت انگلیسی  International Standard Book Number)) نشان می‌دهند. در سال ۱۹۶۷ استاندارد شابک برای اولین بار به صورت ده رقمی مطرح شد و نهایتاً در سال ۱۹۷۰ توسط سازمان بین‌المللی استانداردسازی (ایزو) به عنوان استاندارد ایزو ۲۱۰۸ در سال ۱۹۷۰ به چاپ رسید. از آن زمان تا پایان سال ۲۰۰۶ شابک‌ها ده‌رقمی بودند. از سال ۲۰۰۷ برای آن که تعداد بیشتری کتاب را بتوان شماره‌گذاری کرد، شابک سیزده‌رقمی شده‌است. استفاده شابک یا ISBN برای فروش و کنترل انبار کتب توسط ناشران، کتاب‌فروشان، کتابخانه‌ها، و سایر مشترکین می‌باشد. شابک به شما کمک می‌کند که یک کتاب را از میان کتاب‌های دیگر بدون آنکه به اسم کتاب، ناشر، نویسنده و یا سایر مشخصات دیگر کتاب نیاز داشته باشید از طریق این شماره بازیابی و جستجو کنید. در «انتشارات خط هشت» پس از طی مراحل اولیه کتاب به هر کتاب یک شابک یا ISBN اختصاص داده می‌شود که از آن زمان به بعد این کد منحصربه ‌فرد نشان دهنده شماره شناسه کتاب خواهد بود. لازم به ذکر است شابک یا (ISBN)  در قسمت شناسنامه کتاب، فیپای کتاب و پشت جلد کتاب به صورت بارکد نیز نوشته می‌شود. «انتشارات خط هشت»  بلافاصله بعد از دریافت فایل اولیه کتاب از نویسندگان و توافق اولیه کد شابک را اختصاص می دهد. مدارک لازم جهت اخذ شابک : کپی شناسنامه یا کارت ملی نویسنده  اسم کتاب مشخصات کتاب (شامل قطع، نوبت چاپ) اختصاص شابک جدید برای چاپ مجدد کتاب با یکی از شرط های زیر الزامی است. ویرایش و تغییر محتوا، قطع کتاب،  نوع جلد (شومیز، گالینگور …) ، تغییر عنوان، تغییر ناشر",
  "فیپا چیست ؟":
    "فیپا تهیه اطلاعات کتابشناختی برای شناسایی و بازیابی یک کتاب بر مبنای ضوابط و استانداردهای بین المللی قبل از انتشار آن کتاب است. کتابشناسی ملی حاصل همکاری تنگاتنگ ناشران با سازمان اسناد و کتابخانه ملی جمهوری اسلامی ایران جهت تهیه فهرست نویسی کتاب ها می باشد. در حال‌ حاضر بسیاری‌ از کشورهای‌ جهان‌ از این‌ طرح‌استقبال‌ کرده‌اند. در ایران نیز در سال ۱۳۷۱ کتابخانه ملی‌ ایران‌ این‌ طرح‌ را به‌ طور آزمایشی‌ با برخی‌ از ناشران‌ به‌ اجرا گذاشت‌ و پس‌ از موفقیت‌ نسبی‌ پیشنهاد قانونی‌ شدن‌ آن‌، طی‌ طرحی‌ در اسفند ۱۳۷۴ از سوی‌ کتابخانه ملی‌ به‌ هیئت‌ دولت‌ ارائه‌ شد که‌ تصویبنامه آن‌ در سال ۱۳۷۵ به‌ کتابخانه ملی‌ ابلاغ‌ شد و مسئولیت‌ اجرایی‌ طرح‌ بر عهده‌ کتابخانه ملی‌ نهاده‌ شده است. در مهر ۱۳۷۷ کتابخانه ملی‌ با همکاری‌ وزارت‌ فرهنگ‌ و ارشاد اسلامی‌ اجرای‌ طرح‌ را به‌ طور رسمی‌ آغاز کرد. از مزایای فیپا می‌توان به کاهش هزینه‌های فهرست نویسی در کتابخانه‌ها و مراکز اطلاعاتی کشور، یکدستی در اطلاعات کتاب شناختی فهرست‌های کتابخانه‌های سراسر کشور و تسریع در پخش اطلاعات مربوط به انتشار یک اثر در سطح شبکه‌های ملی و بین‌المللی نام برد. اداره کل پردازش و سازماندهی سازمان اسناد و کتابخانه ملی مسئول مستقیم صدور فیپا در جمهوری اسلامی ایران می باشد و هیچ نماینده ای در سطح کشور ندارد و صدور فیپا تنها توسط سازمان و اسناد و کتابخانه ملی جمهوری اسلامی ایران و با معرفی ناشران انجام می گردد. در فیپای کتاب اطلاعاتی به شرح زیر درج می‌گردد. سرشناسه: در قسمت سرشناسه نام نویسنده اصلی کتاب همراه با سال تولد ایشان می‌آید. عنوان و نام پدیدآور: در این قسمت نام کتاب و نام تمامی نویسندگان نوشته می‌شود. مشخصات نشر: در این قسمت آدرس انتشارات کتاب، نام انتشارات کتاب و سال چاپ کتاب می‌آید. مشخصات ظاهری: شامل تعداد صفحات کتاب و در صورت وجود جدول، تصویر، نمودار می‌باشد. شابک یا (ISBN): شماره شابک یا (ISBN) کتاب در این قسمت درج می‌گردد.موضوع: موضوع کتاب و کلمات کلیدی کتب را شامل می‌شود. شناسه افزوده: در صورتی که کتاب بیش از یک نویسنده داشته باشد نام بقیه نویسندگان به صورت جداگانه در شناسه افزوده نوشته می‌شود رده‌بندی کنگره، رده‌بندی دیویی و شماره کتاب‌شناسی ملی: این مشخصات مربوط به کدهای ثبت کتاب در کتابخانه ملی و مرکز فیپا می‌باشد.",
  "درخواست فیپا چگونه انجام می گیرد؟":
    "ارسال درخواست فیپا تنها به صورت الکترونیکی امکان پذیر می باشد. لذا « انتشارات خط هشت » درخواست  اخذ فیپا برای کتابهای خود (شامل تکمیل پرسشنامه و الحاق فایل های مربوط به کتاب) را به صورت الکترونیکی در وب گاه سازمان اسناد و کتابخانه ملی جمهوری اسلامی ایران  انجام می دهد و پس از ارسال درخواست فیپا، کد رهگیری به منزله رسید، اخذ می گردد. در صورتی که اطلاعات ارسالی کامل و صحیح باشد پس از گذشت مدت زمان معین، فیپای کتاب در سایت سازمان اسناد و کتابخانه ملی قابل رویت خواهد بود. فرآیند صدور فیپای الکترونیکی در صورت کامل بودن و صحت اطلاعات ارائه شده ، برای کتابهای تجدید چاپی ، حدود ۳ روز، کتابهای چاپ شده توسط ناشر دیگر، ۵ روز و برای کتاب های چاپ اول ۱۲ روز کاری،  زمان نیاز دارد. مدارک لازم جهت اخذ فیپا:  کپی شناسنامه یا کارت ملی تمامی نویسندگان  فایل نهایی کتاب (این فایل می‌بایست ویراستاری شده، صفحه آرایی شده و دارای کد شابک باشد) مشخصات کتاب (شامل قطع، تعداد صفحات، کد شابک، سال چاپ) نکته: در مورد کتاب‌های ترجمه شده، اسکن صفحه عنوان کتاب اصلی الزامی می‌باشد.",
  "مجوز چاپ کتاب چگونه اخذ می شود ؟":
    "میدانیم که چاپ هر کتابی به خودی خود ارزش و اعتباری ندارد. اعتبار کتاب به دارا بودن شناسنامه کتاب و درج آن در صفحات اولیه کتاب است. گرفتن مجوزهای قانونی برای کتاب، تمامی حقوق مادی و معنوی آن را برای نویسندگان محفوظ می‌کند. تمامی کتابهایی که بدون مجوزهای قانونی چاپ می‌شوند به لحاظ پیگیری قانونی و مالکیت به هیچ وجه قابل پیگیری نیستند. یعنی کتاب هایی که این مجوز را ندارند به هیچ عنوان حق داشتن پیگرد قانونی و مالکیت را ندارند. بحث مجوز های چاپ کتاب یکی از مهم ترین و الزامی ترین مراحل و خدمات پیش از چاپ می باشد.«انتشارات خط هشت » پس از آماده شدن متن کتاب که شناسنامه صادر شده توسط کتابخانه ملی درآن وارد شده است ( شابک و فیپا ) وطراحی جلد کتاب ، در این مرحله با ارسال فایل نهایی کتاب و طرح جلد کتاب برای وزارت فرهنگ و ارشاد اسلامی درخواست دریافت مجوز قبل از چاپ می نماید.دراین مرحله با توجه به نوع و موضوع کتاب که تخصصی، علمی، کودکان، دینی و مذهبی و …باشد، فایل کتاب برای مراجع و اشخاص ذیصلاح ارسال می گردد و ویرایشات و یا تائید نهایی کتاب صورت می پذیرد. (این مرحله  زمانبرترین مرحله در روند مراحل چاپ کتاب می باشد که ممکن است برای برخی کتب به چندین ماه نیز به طول بیانجامد) در وزارت فرهنگ و ارشاد اسلامی کتاب با شناسنامه تطبیق داده و متن کتاب را از نظر ممیزی های مختلف از جمله سیاسی و اخلاقی و مذهبی و غیره بررسی میکنند و در صورت صدور مجوز وزارت ارشاد، انتشارات اجازه دارد کتاب را چاپ کند. نکات مهم .. باید درخواست مجوز را قبل از چاپ کتاب به ثبت برسانید. توجه کنید که اگر قبل از نام نویسنده لقب (مهندس، دکتر و…) قرار بگیرد، باید مدرک تحصیلی مربوطه را هم در پیوست مدارک شناسایی برای اداره ارشاد و فیپا ارسال شود.",
  "اعلام وصول چیست ؟":
    "اعلام وصول یا همان مجوز پخش، مجوزی می باشد که ناشران کتاب به منظور تکمیل مراحل چاپ کتاب خود اقدام به اخذ آن از وزارت فرهنگ وارشاد اسلامی می نمایند. پس از این مرحله است که نویسنده و ناشر می توانند کتاب را نشر دهند.آخرین بخش از مراحل چاپ کتاب، اعلام وصول آن به منظور داشتن مجوز پخش کتاب می‌باشد و این کار در حقیقت این معنی را می دهد که چاپ کتاب صورت گرفته وبا آنچه در وزارت فرهنگ وارشاد اسلامی ثبت شده برابری کرده و تغییری نکرده است و پخش آن بلامانع می باشد و همچنین می توان گفت اعلام وصول تاییدی بر بی عیب و نقص بودن کلیه روند اخذ مجوزهای لازم برای کتاب چاپ شده می باشد. روند صدور اعلام وصول تا یک ماه به طول می انجامد که در این مرحله از مراحل چاپ کتاب فرم هایی که مرتبط با کتابخانه ملی هستند برای وزارت فرهنگ وارشاد اسلامی ارسال شده و مسئولین این بخش در وزارت ارشاد با بررسی کتاب و درخواست اقدام به صدور اعلام وصول کتاب می نمایند.بعد از چاپ کتاب وجهت اخذ اعلام وصول، « انتشارات خط هشت » بایستی پنج نسخه از کتاب چاپ شده را به همراه فرم تکمیل شده اعلام وصول به اداره کل فرهنگ و ارشاد اسلامی استان تحویل دهد. تا کتاب چاپ شده برای کتابخانه ملی و خانه کتاب ارسال شود. لذا پس از چاپ کتاب حداقل 5 نسخه از کتاب توسط نویسنده در اختیار « انتشارات خط هشت » قرار می گیرد.",
};

export default function MainPage() {
  const dispatch = useAppDispatch();
  const [name, nameHandler] = useState("");
  const [desc, descHandler] = useState("");
  const [phone, phoneHandler] = useState<number | "">();
  return (
    <>
      <div className="flex space-y-5 flex-col items-center  bg-gray-100">
        <Header state={0} />
        <div className="px-36 w-full space-y-5 pt-12">
          <div className="w-full bg-white p-10 rounded-xl">
            <label className="text-justify">
              با رویکرد حفظ و زنده نگه داشتن کتاب وهمچنین توسعه فرهنگ کتابخوانی
              ، اقدام به راه اندازی مجموعه چاپ به اندازه ی تقاضا «Print On
              Demand » ، در راستای حفظ منابع سبزمان و کاهش بی رویه کاغذ «Green
              Printing » و همچنین چاپ در کوتاهترین زمان «Short Run Printing » در
              استان اردبیل نموده است . انتشارات خط هشت : انتشارات خط هشت با مجوز
              رسمی از وزرارت فرهنگ و ارشاد اسلامی با شماره مجوز( 11897) و بیش از
              ده سال سابقه فعالیت در حوزه نشر: در زمینه چاپ کتاب به دو صورت
              دیجیتال ( تیراژ کم ) و افست در کوتاهترین و سریعترین زمان ممکن با
              شرایط استثنایی و با رعایت کلیه مراحل آماده سازی کتاب شامل صفحه
              آرایی و طراحی جلد و …. اقدام نموده و کتاب شما را با ( موضوعات
              مختلف تبدیل پایان نامه به کتاب ، آموزشی، علمی ، شعر، داستان ، رمان
              ، ترجمه و ……. ) با اخذ شابک ISBN از اداره شابک و فیپا از کتابخانه
              ملی در وزارت فرهنگ و ارشاد اسلامی مجوز چاپ گرفته و اعلام وصول می
              نماید . چاپ کتاب در تیراژ مورد نیاز شما از ( 20 جلد تا چند هزار
              جلد ) و در سایزهای مختلف و استاندارد ( رقعی، وزیری، رحلی و …. ) با
              کمترین هزینه و دارای همه امتیازات لازم جهت ارائه و تقویت روزمه های
              تحصیلات تکمیلی و مصاحبه دکتری PHD و رزومه های اخذ دانشیاری و
              ارتقای تحصیلی و شغلی در انتشارات خط هشت انجام گرفته و اندیشه های
              شما را به اثری ماندگار تبدیل می کند. انتشارات خط هشت افتخار دارد
              خدمات چاپ کتاب، چاپ دیجیتال و تمام راهکارهای خوب چاپ کتاب را برای
              شما در یک جا جمع‌آوری کرده‌است.
            </label>
          </div>

          <div
            className="lg:space-x-5 space-y-5 flex flex-col bg-white w-full rounded-xl
            lg:flex-row items-center justify-between p-5 rtl:space-x-reverse"
          >
            <div className="flex flex-col space-y-5 items-center">
              <div className="w-96">
                <Image
                  src="https://currencyno.storage.iran.liara.space/Banners/caffeh/topBanners/reserveCaffee.jpg"
                  width="0"
                  height="0"
                  sizes="100vw"
                  alt="reserve"
                  className="h-auto w-full opacity-50"
                />
              </div>
              <label className="text-center text-xl font-bold text-gray-600 ">
                موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان
              </label>
            </div>
            <div className="flex flex-col space-y-5 items-center">
              <div className="space-y-5">
                <Input
                  value={name}
                  handler={nameHandler}
                  title="نام و نام خانوادگی"
                />
                <PhoneInput
                  value={phone}
                  handler={phoneHandler}
                  title="شماره تلفن"
                />
              </div>
              <button
                onClick={() => {
                  if (
                    phone !== undefined &&
                    name !== undefined &&
                    phone !== ""
                  ) {
                    dispatch(
                      coffeeOrderThunk({ name, phone, desc: desc || "" })
                    );
                    nameHandler("");
                    phoneHandler("");
                  } else {
                    dispatch(
                      setNotif({
                        type: "error",
                        title: "مشکل در ارسال اطلاعات",
                        message: "لطفا همه فیلد ها را به درستی پر کنید",
                      })
                    );
                  }
                }}
                className="bg-amber-400 p-5 rounded-xl w-44 text-xl"
              >
                ارسال درخواست
              </button>
            </div>
          </div>
          <div className="flex flex-col bg-white p-5 rounded-xl space-y-5">
            <label className="text-xl font-bold">سوالات متداول</label>
            <Collapse
              ghost
              items={Object.entries(questions).map(([q, a], index) => ({
                key: index,
                label: <p className="text-lg">{q}</p>,
                children: (
                  <label className="md:leading-loose text-justify">{a}</label>
                ),
              }))}
            />
          </div>
        </div>
        <Footer />
      </div>
    </>
  );
}
